###########算數運算############
#       +     加
#       -     減
#       *     乘
#       /     小數除法
#       %     取餘數除法
#       **    次方運算
#       //    整數除法

x=3//2    # 整數除法
print(x)
x=3+2      # 加
print(x)
x=3-2      # 減
print(x)
x=3*2      # 乘
print(x)
x=3/2    # 小數除法
print(x)
x=3%2    # 取餘數除法
print(x)
x=3**2    # 次方運算
print(x)
x=3**0.5    # 開根號運算
print(x)
x=3//2    # 整數除法
print(x)
###########賦值運算############
#    =	    简单賦值運算    c = a + b 将 a + b 的运算结果赋值为 c
#    +=	    加法賦值運算	c += a 等效于 c = c + a
#    -=	    减法賦值運算	c -= a 等效于 c = c - a
#    *=	    乘法賦值運算	c *= a 等效于 c = c * a
#    /=	    除法賦值運算	c /= a 等效于 c = c / a
#    %=	    取模賦值運算    c %= a 等效于 c = c % a
#    **=	幂賦值運算  	c **= a 等效于 c = c ** a
#    //=	取整除賦值運算   c //= a 等效于 c = c // a

###########比較運算############
#       ==      等於
#       !=      不等於
#       >       大於
#       <       小於
#       >=      大於等於
#       <=      小於等於




#############以下是字串################

s='WAKAKA\'LALA\'WAWAWA'
print(s)
# 3個單or雙引號可以直接換行
s="""WAKAKA\'LA
    
    
    
    爽啦~~就愛空這麼多行，你打我撒
    
    
    
    LA\'WAWAWA"""
print(s)
s='你打我撒~'*3 + '不打臉行不'
print(s)
print(s[1])   # 第幾個字
print(s[4])   # 第幾個字
print(s[15:19])   # 第幾個字開始第幾個字結束，包含開頭不包含結尾
print(s[15:])   # 只給開頭，不給結尾
print(s[:15])   # 只給結尾，不給開頭